UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_РегламентныеЗаданияРасширения/рар_мп_РегламентныеЗаданияРасширения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_РегламентныеЗаданияРасширения</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>РегламентноеЗадание</name>
    <type>
      <types>EnumRef.рар_мп_ВидРегламентыхЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_РегламентныеЗаданияРасширения/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;    
	
	//@skip-check module-self-reference
	Если ЭтотОбъект.Количество() = 0 Тогда 
		УдалитьСозданноеРегЗадание(ЭтотОбъект.Отбор.РегламентноеЗадание.Значение);	
	КонецЕсли;
	
	Расписание =  Новый РасписаниеРегламентногоЗадания; // создаем расписание 	
	Расписание.ПериодПовтораВТечениеДня = 300;
	Расписание.ПериодПовтораДней = 1;
		
	Для каждого Запись ИЗ ЭтотОбъект Цикл
		
		//@skip-check undefined-variable
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Задание = РегламентныеЗаданияСервер.Задание(Запись.Идентификатор);
		
		Если Задание = Неопределено Тогда 
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Ключ", Запись.Идентификатор);
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
			//ПараметрыЗадания.Вставить("Расписание", Запись.Расписание.Получить()); 
			ПараметрыЗадания.Вставить("Расписание", Расписание);
			
			//@skip-check undefined-variable
			//@skip-check bsl-legacy-check-dynamic-feature-access
			Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			
			Запись.Идентификатор = Задание.УникальныйИдентификатор;
			//Запись.УИД = Задание.УникальныйИдентификатор;
		Иначе
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
			ПараметрыЗадания.Вставить("Использование", Запись.Использование);
			ПараметрыЗадания.Вставить("Наименование", Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Ключ", Запись.Идентификатор);
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
			МассивПараметров.Добавить(Запись.РегламентноеЗадание);
			ПараметрыЗадания.Вставить("Параметры", МассивПараметров);
			//ПараметрыЗадания.Вставить("Расписание", Запись.Расписание.Получить());
			ПараметрыЗадания.Вставить("Расписание", Расписание);
			
			//@skip-check undefined-variable
			//@skip-check bsl-legacy-check-dynamic-feature-access
			РегламентныеЗаданияСервер.ИзменитьЗадание(Запись.Идентификатор, ПараметрыЗадания);  
			
		КонецЕсли;			
		
	КонецЦикла;
	
КонецПроцедуры    


Процедура УдалитьСозданноеРегЗадание(РегламентноеЗадание)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рар_мп_РегламентныеЗаданияРасширения.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.рар_мп_РегламентныеЗаданияРасширения КАК рар_мп_РегламентныеЗаданияРасширения
	|ГДЕ
	|	рар_мп_РегламентныеЗаданияРасширения.РегламентноеЗадание = &РегламентноеЗадание";
	
	Запрос.УстановитьПараметр("РегламентноеЗадание", РегламентноеЗадание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//МассивУИД = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		//@skip-check undefined-variable
		//@skip-check bsl-legacy-check-dynamic-feature-access
		РегламентныеЗаданияСервер.УдалитьЗадание(Выборка.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры
